remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samr35/include/samr35j17b.h
/**
 * \file
 *
 * \brief Header file for SAMR35J17B
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License"); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMR35J17B_
#define _SAMR35J17B_

/**
 * \ingroup SAMR35_definitions
 * \addtogroup SAMR35J17B_definitions SAMR35J17B definitions
 * This file defines all structures and symbols for SAMR35J17B:
 *   - registers and bitfields
 *   - peripheral base address
 *   - peripheral ID
 *   - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */
#endif

#if !defined(SKIP_INTEGER_LITERALS)
#if defined(_U_) || defined(_L_) || defined(_UL_)
  #error "Integer Literals macros already defined elsewhere"
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#define _U_(x)         x ## U            /**< C code: Unsigned integer literal constant value */
#define _L_(x)         x ## L            /**< C code: Long integer literal constant value */
#define _UL_(x)        x ## UL           /**< C code: Unsigned Long integer literal constant value */
#else /* Assembler */
#define _U_(x)         x                 /**< Assembler: Unsigned integer literal constant value */
#define _L_(x)         x                 /**< Assembler: Long integer literal constant value */
#define _UL_(x)        x                 /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */

/* ************************************************************************** */
/**  CMSIS DEFINITIONS FOR SAMR35J17B */
/* ************************************************************************** */
/** \defgroup SAMR35J17B_cmsis CMSIS Definitions */
/*@{*/

/** Interrupt Number Definition */
typedef enum IRQn
{
  /******  Cortex-M0+ Processor Exceptions Numbers *******************/
  NonMaskableInt_IRQn      = -14,/**<  2 Non Maskable Interrupt      */
  HardFault_IRQn           = -13,/**<  3 Hard Fault Interrupt        */
  SVCall_IRQn              = -5, /**< 11 SV Call Interrupt           */
  PendSV_IRQn              = -2, /**< 14 Pend SV Interrupt           */
  SysTick_IRQn             = -1, /**< 15 System Tick Interrupt       */
  /******  SAMR35J17B-specific Interrupt Numbers *********************/
  SYSTEM_IRQn              =  0, /**<  0 SAMR35J17B System Interrupts */
  WDT_IRQn                 =  1, /**<  1 SAMR35J17B Watchdog Timer (WDT) */
  RTC_IRQn                 =  2, /**<  2 SAMR35J17B Real-Time Counter (RTC) */
  EIC_IRQn                 =  3, /**<  3 SAMR35J17B External Interrupt Controller (EIC) */
  NVMCTRL_IRQn             =  4, /**<  4 SAMR35J17B Non-Volatile Memory Controller (NVMCTRL) */
  DMAC_IRQn                =  5, /**<  5 SAMR35J17B Direct Memory Access Controller (DMAC) */
  EVSYS_IRQn               =  7, /**<  7 SAMR35J17B Event System Interface (EVSYS) */
  SERCOM0_IRQn             =  8, /**<  8 SAMR35J17B Serial Communication Interface 0 (SERCOM0) */
  SERCOM1_IRQn             =  9, /**<  9 SAMR35J17B Serial Communication Interface 1 (SERCOM1) */
  SERCOM2_IRQn             = 10, /**< 10 SAMR35J17B Serial Communication Interface 2 (SERCOM2) */
  SERCOM3_IRQn             = 11, /**< 11 SAMR35J17B Serial Communication Interface 3 (SERCOM3) */
  SERCOM4_IRQn             = 12, /**< 12 SAMR35J17B Serial Communication Interface 4 (SERCOM4) */
  SERCOM5_IRQn             = 13, /**< 13 SAMR35J17B Serial Communication Interface 5 (SERCOM5) */
  TCC0_IRQn                = 14, /**< 14 SAMR35J17B Timer Counter Control 0 (TCC0) */
  TCC1_IRQn                = 15, /**< 15 SAMR35J17B Timer Counter Control 1 (TCC1) */
  TCC2_IRQn                = 16, /**< 16 SAMR35J17B Timer Counter Control 2 (TCC2) */
  TC0_IRQn                 = 17, /**< 17 SAMR35J17B Basic Timer Counter 0 (TC0) */
  TC1_IRQn                 = 18, /**< 18 SAMR35J17B Basic Timer Counter 1 (TC1) */
  TC2_IRQn                 = 19, /**< 19 SAMR35J17B Basic Timer Counter 2 (TC2) */
  TC3_IRQn                 = 20, /**< 20 SAMR35J17B Basic Timer Counter 3 (TC3) */
  TC4_IRQn                 = 21, /**< 21 SAMR35J17B Basic Timer Counter 4 (TC4) */
  ADC_IRQn                 = 22, /**< 22 SAMR35J17B Analog Digital Converter (ADC) */
  AC_IRQn                  = 23, /**< 23 SAMR35J17B Analog Comparators (AC) */
  DAC_IRQn                 = 24, /**< 24 SAMR35J17B Digital-to-Analog Converter (DAC) */
  PTC_IRQn                 = 25, /**< 25 SAMR35J17B Peripheral Touch Controller (PTC) */
  AES_IRQn                 = 26, /**< 26 SAMR35J17B Advanced Encryption Standard (AES) */
  TRNG_IRQn                = 27, /**< 27 SAMR35J17B True Random Generator (TRNG) */

  PERIPH_COUNT_IRQn        = 29  /**< Number of peripheral IDs */
} IRQn_Type;

